blog/28.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 3.4 Concurrency: Time Is of the Essence
#+subtitle: 2024-04-14 Sun
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)

- We have seen that computational objects with local state are
  powerful tools for modeling.

- We had to pay a price though:
  - Loss of referential transparency;
  - Adoption of a more intricate environment model.

- ``The central issue lurking beneath the complexity of state,
  sameness, and change is that by introducing assignment we are forced
  to admit time into our computational models. Before we introduced
  assignment, all our programs were timeless, in the sense that any
  expression that has a value always has the same value.''

- ``Building models in terms of computational objects with local state
  forces us to confront time as an essential concept in programming.''

- ``We can go further in structuring computational models to match our
  perception of the physical world.  Objects in the world do not
  change one at a time in sequence.  Rather we perceive them as acting
  "concurrently" --- all at once.''

- Introducing assignment means admitting /time/.

- Our programs are not timeless anymore.
  - Successive evaluations of the same expression can yield different
    values.
  - The result of an evaluation now depends not only on the expression
    itself, but also on whether the evaluation occurs before or after
    one the moments delineated by the execution of assignment
    statements.

- For any event A and B: either A happens and then B happens, or B
  happens and then A happens, or A and B happen at the same time.

- Authors give the example of Peter and Paul withdrawing from an
  account at the same. Concurrency, in the example, is not handled
  correctly.
  - ``The general phenomenon illustrated here is that several processes
    may share a common state variable.''
  - ``The above example typifies the subtle bugs that can creep into
    concurrent programs.  The root of this complexity lies in the
    assignments to variables that are shared among the different
    processes.''

- Consider two processes, each of which with three ordered
  events. Respectively: (a, b, c), and (x, y, z). There are 20
  possible orderings. (See p. 303)

- Consider a parallel execution of ~(set! x (* x x))~ and ~(set! x (+
  x 1))~.
  - We can do so using ~parallel-execute~:
    #+begin_src emacs-lisp
      (define x 10)

      (parallel-execute (lambda () (set! x (* x x)))
                        (lambda () (set! x (+ x 1))))
    #+end_src
  - There are five possible final values for the variable ~x~.
  - If we use a /serializer/, though, there are only two possible final
    values.
    - here is how we would use a serializer:
      #+begin_src emacs-lisp
        (define x 10)

        (define s (make-serializer))

        (parallel-execute (s (lambda () (set! x (* x x))))
                          (s (lambda () (set! x (+ x 1)))))
      #+end_src

- We can now write a safer version of ~make-account~:
  #+begin_src emacs-lisp
    (define (make-account balance)
            (define (withdraw amount)
                    (if (>= balance amount)
                        (begin (set! balance (- balance amount))
                               balance)
                      "Insufficient funds"))
            (define (deposit amount)
                    (set! balance (+ balance amount))
                    balance)
            (let ((protected (make-serializer)))
              (define (dispatch m)
                      (cond ((eq? m 'withdraw) (protected withdraw))
                            ((eq? m 'deposit) (protected deposit))
                            ((eq? m 'balance) balance)
                            (else (error "Unknown request -- MAKE-ACCOUNT"
                                         m))))
              dispatch))
  #+end_src

- Consider this procedure which swaps the value of two accounts:
  #+begin_src emacs-lisp
    (define (exchange account1 account2)
            (let ((difference (- (account1 'balance)
                                 (account2 'balance))))
              ((account1 'withdraw) difference)
              ((account2 'deposit) difference)))
  #+end_src

  - ``For correct behavior, we must arrange for the ~exchange~ procedure
    to lock out any other concurrent accesses to the accounts during the
    entire time of the exchange.''

- Authors show how to implement a serializer using a /mutex/ (aka
  /lock/).
  #+begin_src emacs-lisp
    (define (make-serializer)
            (let ((mutex (make-mutex)))
              (lambda (p)
                (define (serialized-p . args)
                        (mutex 'acquire)
                        (let ((val (apply p args)))
                          (mutex 'release)
                          val))
                serialized-p)))

    (define (make-mutex)
            (let ((cell (list false)))
              (define (the-mutex m)
                      (cond ((eq? m 'acquire)
                             (if (test-and-set! cell)
                                 (the-mutex 'acquire))) ; retry
                            ((eq? m 'release) (clear! cell))))
              the-mutex))

    (define (clear! cell)
            (set-car! cell false))


    (define (test-and-set! cell)
            (if (car cell)
                true
              (begin (set-car! cell true)
                     false)))
  #+end_src

  - Very important detail: the `test-and-set!' operation must be
    performed "atomically". (This operation is also known as Compare And
    Swap, (CAS). See Fedor Pikus' presentation:
    https://youtu.be/ZQFzMfHIxng?t=1028)

- Authors explain what a /deadlock/ is.

