blog/28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-14 Sun 12:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 3.4 Concurrency: Time Is of the Essence</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 3.4 Concurrency: Time Is of the Essence
<br />
<span class="subtitle">2024-04-14 Sun</span>
</h1>
<ul class="org-ul">
<li>We have seen that computational objects with local state are
powerful tools for modeling.</li>

<li>We had to pay a price though:
<ul class="org-ul">
<li>Loss of referential transparency;</li>
<li>Adoption of a more intricate environment model.</li>
</ul></li>

<li>``The central issue lurking beneath the complexity of state,
sameness, and change is that by introducing assignment we are forced
to admit time into our computational models. Before we introduced
assignment, all our programs were timeless, in the sense that any
expression that has a value always has the same value.''</li>

<li>``Building models in terms of computational objects with local state
forces us to confront time as an essential concept in programming.''</li>

<li>``We can go further in structuring computational models to match our
perception of the physical world.  Objects in the world do not
change one at a time in sequence.  Rather we perceive them as acting
"concurrently" &#x2014; all at once.''</li>

<li>Introducing assignment means admitting <i>time</i>.</li>

<li>Our programs are not timeless anymore.
<ul class="org-ul">
<li>Successive evaluations of the same expression can yield different
values.</li>
<li>The result of an evaluation now depends not only on the expression
itself, but also on whether the evaluation occurs before or after
one the moments delineated by the execution of assignment
statements.</li>
</ul></li>

<li>For any event A and B: either A happens and then B happens, or B
happens and then A happens, or A and B happen at the same time.</li>

<li>Authors give the example of Peter and Paul withdrawing from an
account at the same. Concurrency, in the example, is not handled
correctly.
<ul class="org-ul">
<li>``The general phenomenon illustrated here is that several processes
may share a common state variable.''</li>
<li>``The above example typifies the subtle bugs that can creep into
concurrent programs.  The root of this complexity lies in the
assignments to variables that are shared among the different
processes.''</li>
</ul></li>

<li>Consider two processes, each of which with three ordered
events. Respectively: (a, b, c), and (x, y, z). There are 20
possible orderings. (See p. 303)</li>

<li>Consider a parallel execution of <code>(set! x (* x x))</code> and <code>(set! x (+
  x 1))</code>.
<ul class="org-ul">
<li><p>
We can do so using <code>parallel-execute</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define x 10)

(parallel-execute (<span style="color: #531ab6;">lambda</span> () (set! x (* x x)))
                  (<span style="color: #531ab6;">lambda</span> () (set! x (+ x 1))))
</pre>
</div></li>
<li>There are five possible final values for the variable <code>x</code>.</li>
<li>If we use a <i>serializer</i>, though, there are only two possible final
values.
<ul class="org-ul">
<li><p>
here is how we would use a serializer:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define x 10)

(define s (make-serializer))

(parallel-execute (s (<span style="color: #531ab6;">lambda</span> () (set! x (* x x))))
                  (s (<span style="color: #531ab6;">lambda</span> () (set! x (+ x 1)))))
</pre>
</div></li>
</ul></li>
</ul></li>

<li><p>
We can now write a safer version of <code>make-account</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define (make-account balance)
        (define (withdraw amount)
                (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
                    (begin (set! balance (- balance amount))
                           balance)
                  <span style="color: #3548cf;">"Insufficient funds"</span>))
        (define (deposit amount)
                (set! balance (+ balance amount))
                balance)
        (<span style="color: #531ab6;">let</span> ((protected (make-serializer)))
          (define (dispatch m)
                  (<span style="color: #531ab6;">cond</span> ((eq? m 'withdraw) (protected withdraw))
                        ((eq? m 'deposit) (protected deposit))
                        ((eq? m 'balance) balance)
                        (else (<span style="color: #884900;">error</span> <span style="color: #3548cf;">"Unknown request -- MAKE-ACCOUNT"</span>
                                     m))))
          dispatch))
</pre>
</div></li>

<li><p>
Consider this procedure which swaps the value of two accounts:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define (exchange account1 account2)
        (<span style="color: #531ab6;">let</span> ((difference (- (account1 'balance)
                             (account2 'balance))))
          ((account1 'withdraw) difference)
          ((account2 'deposit) difference)))
</pre>
</div>

<ul class="org-ul">
<li>``For correct behavior, we must arrange for the <code>exchange</code> procedure
to lock out any other concurrent accesses to the accounts during the
entire time of the exchange.''</li>
</ul></li>

<li><p>
Authors show how to implement a serializer using a <i>mutex</i> (aka
<i>lock</i>).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define (make-serializer)
        (<span style="color: #531ab6;">let</span> ((mutex (make-mutex)))
          (<span style="color: #531ab6;">lambda</span> (p)
            (define (serialized-p . args)
                    (mutex 'acquire)
                    (<span style="color: #531ab6;">let</span> ((val (apply p args)))
                      (mutex 'release)
                      val))
            serialized-p)))

(define (make-mutex)
        (<span style="color: #531ab6;">let</span> ((cell (list false)))
          (define (the-mutex m)
                  (<span style="color: #531ab6;">cond</span> ((eq? m 'acquire)
                         (<span style="color: #531ab6;">if</span> (test-and-set! cell)
                             (the-mutex 'acquire))) <span style="color: #595959;">; </span><span style="color: #595959;">retry</span>
                        ((eq? m 'release) (clear! cell))))
          the-mutex))

(define (clear! cell)
        (set-car! cell false))


(define (test-and-set! cell)
        (<span style="color: #531ab6;">if</span> (car cell)
            true
          (begin (set-car! cell true)
                 false)))
</pre>
</div>

<ul class="org-ul">
<li>Very important detail: the `test-and-set!' operation must be
performed "atomically". (This operation is also known as Compare And
Swap, (CAS). See Fedor Pikus' presentation:
<a href="https://youtu.be/ZQFzMfHIxng?t=1028">https://youtu.be/ZQFzMfHIxng?t=1028</a>)</li>
</ul></li>

<li>Authors explain what a <i>deadlock</i> is.</li>
</ul>
