blog/28.org
* Exercise 3.38
*Exercise*:

#+begin_quote
Suppose that Peter, Paul, and Mary share a joint bank account that
initially contains $100.  Concurrently, Peter deposits $10, Paul
withdraws $20, and Mary withdraws half the money in the account, by
executing the following commands:

    Peter: ~(set! balance (+ balance 10))~
    Paul:  ~(set! balance (- balance 20))~
    Mary:  ~(set! balance (- balance (/ balance 2)))~

 a. List all the different possible values for `balance' after these
    three transactions have been completed, assuming that the banking
    system forces the three processes to run sequentially in some
    order.

 b. What are some other values that could be produced if the system
    allows the processes to be interleaved?  Draw timing diagrams like
    the one in *Note Figure 3-29 to explain how these values can occur.

#+end_quote

*Answer*:

a:

#+begin_src
| peter | peter |  mary |  paul |  paul |  mary |
|  paul |  mary | peter | peter |  mary |  paul |
|  mary |  paul |  paul |  mary | peter | peter |
|-------+-------+-------+-------+-------+-------|
|   110 |   110 |    50 |    80 |    80 |    50 |
|    90 |    55 |    30 |    90 |    40 |    30 |
|    45 |    35 |    40 |    45 |    50 |    40 |
#+end_src

b:

Here is an example of how we could end up with 110 in the bank:
#+begin_src
  |              Peter            Paul            Bank            Mary
  |
  |               +----------------+--------------100--------------+
  |               |                |                               |
  |               |                V                               |
  |               |           Access val: 100                      |
  |               |                |                               |
  |               |                |                               V
  |               |                |                        Access val: 100
  |               |                |                               |
  |               V                |                               |
  |      Access val: 100           |                               |
  |               |                |                               |
  |               |                V                               |
  |               |            New val: 80                         |
  |               |                |                               V
  |               |                |                          New val: 50
  |               V                |                               |
  |         New val: 110           |                               |
  |               |                V                               |
  |               |            Set 80 ----------->80               |
  |               |                                                |
  |               |                                                |
  |               |                                                V
  |               |                               50<----------Set 50
  |               |
  |               V
  |            Set 110--------------------------->110
  V
time
#+end_src

* Exercise 3.39
*Exercise*:

#+begin_quote
Which of the five possibilities in the parallel
execution shown above remain if we instead serialize execution as
follows:

#+begin_src scheme
  (define x 10)

  (define s (make-serializer))

  (parallel-execute (lambda () (set! x ((s (lambda () (* x x))))))
                    (s (lambda () (set! x (+ x 1)))))
#+end_src
#+end_quote

*Answer*:

I believe there are three possibilities:

- first:
  1. execution of ~(* x x)~. A ~100~ value is created but not
     assigned;
  2. execution of ~(set! x (+ x 1))~. ~x~ is now ~11~;
  3. execution of ~(set! x 100)~. x is now ~100~;
- second:
  1. execution of ~(* x x)~. A ~100~ value is created but not
     assigned;
  2. execution of ~(set! x 100)~. x is now ~100~;
  3. execution of ~(set! x (+ x 1))~. ~x~ is now ~101~;
- third:
  1. execution of ~(set! x (+ x 1))~. ~x~ is now ~11~;
  2. execution of ~(* x x)~. A ~121~ value is created but not
     assigned;
  3. execution of ~(set! x 121)~. x is now ~121~;

* Exercise 3.40
*Exercise*:

#+begin_quote
Give all possible values of `x' that can result from executing

#+begin_src scheme
  (define x 10)

  (parallel-execute (lambda () (set! x (* x x)))
                    (lambda () (set! x (* x x x))))
#+end_src

Which of these possibilities remain if we instead use serialized
procedures:

#+begin_src scheme
  (define x 10)

  (define s (make-serializer))

  (parallel-execute (s (lambda () (set! x (* x x))))
                    (s (lambda () (set! x (* x x x)))))
#+end_src
#+end_quote

*Answer*:

- The first λ involves three events:
  - two accesses of the variable ~x~; let's called them `1a' and `1b';
  - one ~set!~; let's call it `1s'.
- The second λ involves four events:
  - three accesses of the variable ~x~; let's called them `2a', `2b',
    and `2c';
  - one ~set!~; let's call it `1s'.

- If we serialize, then there are only two possible sequences.

- Here is one:
  - 1a (x is accessed as 10)
  - 1b (x is accessed as 10)
  - 1s (x = 10 * 10 = 100);
  - 2a (x is accessed as 100)
  - 2b (x is accessed as 100)
  - 2c (x is accessed as 100)
  - 2s (x = 100 * 100 * 100 = 1000000)

- Here is the other:
  - 2a (x is accesses as 10)
  - 2b (x is accesses as 10)
  - 2c (x is accesses as 10)
  - 2s (x = 10 * 10 * 10 = 1000)
  - 1a (x is accesses as 1000)
  - 1b (x is accesses as 1000)
  - 1s (x = 1000 * 1000 = 1000000)

- If we don't serialize, then, besides the two sequences above, other
  sequences are possible.

- Here is one:
  - 1a (x is accessed as 10)
  - 2a (x is accessed as 10)
  - 1b (x is accessed as 10)
  - 1s (x = 10 * 10 = 100)
  - 2b (x is accessed as 100)
  - 2c (x is accessed as 100)
  - 2s (x = 10 * 100 * 100 = 100000)

