blog/28.html

<div id="outline-container-org0732348" class="outline-2">
<h2 id="org0732348">Exercise 3.38</h2>
<div class="outline-text-2" id="text-org0732348">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Suppose that Peter, Paul, and Mary share a joint bank account that
initially contains $100.  Concurrently, Peter deposits $10, Paul
withdraws $20, and Mary withdraws half the money in the account, by
executing the following commands:
</p>

<p>
Peter: <code>(set! balance (+ balance 10))</code>
Paul:  <code>(set! balance (- balance 20))</code>
Mary:  <code>(set! balance (- balance (/ balance 2)))</code>
</p>

<p>
a. List all the different possible values for `balance' after these
   three transactions have been completed, assuming that the banking
   system forces the three processes to run sequentially in some
   order.
</p>

<p>
b. What are some other values that could be produced if the system
   allows the processes to be interleaved?  Draw timing diagrams like
   the one in *Note Figure 3-29 to explain how these values can occur.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
a:
</p>

<pre class="example">
| peter | peter |  mary |  paul |  paul |  mary |
|  paul |  mary | peter | peter |  mary |  paul |
|  mary |  paul |  paul |  mary | peter | peter |
|-------+-------+-------+-------+-------+-------|
|   110 |   110 |    50 |    80 |    80 |    50 |
|    90 |    55 |    30 |    90 |    40 |    30 |
|    45 |    35 |    40 |    45 |    50 |    40 |
</pre>

<p>
b:
</p>

<p>
Here is an example of how we could end up with 110 in the bank:
</p>
<pre class="example">
  |              Peter            Paul            Bank            Mary
  |
  |               +----------------+--------------100--------------+
  |               |                |                               |
  |               |                V                               |
  |               |           Access val: 100                      |
  |               |                |                               |
  |               |                |                               V
  |               |                |                        Access val: 100
  |               |                |                               |
  |               V                |                               |
  |      Access val: 100           |                               |
  |               |                |                               |
  |               |                V                               |
  |               |            New val: 80                         |
  |               |                |                               V
  |               |                |                          New val: 50
  |               V                |                               |
  |         New val: 110           |                               |
  |               |                V                               |
  |               |            Set 80 -----------&gt;80               |
  |               |                                                |
  |               |                                                |
  |               |                                                V
  |               |                               50&lt;----------Set 50
  |               |
  |               V
  |            Set 110---------------------------&gt;110
  V
time
</pre>
</div>
</div>

<div id="outline-container-orgce72320" class="outline-2">
<h2 id="orgce72320">Exercise 3.39</h2>
<div class="outline-text-2" id="text-orgce72320">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Which of the five possibilities in the parallel
execution shown above remain if we instead serialize execution as
follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">x</span> 10)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">s</span> (make-serializer))

(parallel-execute (<span style="color: #531ab6;">lambda</span> () (set! x ((s (<span style="color: #531ab6;">lambda</span> () (* x x))))))
                  (s (<span style="color: #531ab6;">lambda</span> () (set! x (+ x 1)))))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I believe there are three possibilities:
</p>

<ul class="org-ul">
<li>first:
<ol class="org-ol">
<li>execution of <code>(* x x)</code>. A <code>100</code> value is created but not
assigned;</li>
<li>execution of <code>(set! x (+ x 1))</code>. <code>x</code> is now <code>11</code>;</li>
<li>execution of <code>(set! x 100)</code>. x is now <code>100</code>;</li>
</ol></li>
<li>second:
<ol class="org-ol">
<li>execution of <code>(* x x)</code>. A <code>100</code> value is created but not
assigned;</li>
<li>execution of <code>(set! x 100)</code>. x is now <code>100</code>;</li>
<li>execution of <code>(set! x (+ x 1))</code>. <code>x</code> is now <code>101</code>;</li>
</ol></li>
<li>third:
<ol class="org-ol">
<li>execution of <code>(set! x (+ x 1))</code>. <code>x</code> is now <code>11</code>;</li>
<li>execution of <code>(* x x)</code>. A <code>121</code> value is created but not
assigned;</li>
<li>execution of <code>(set! x 121)</code>. x is now <code>121</code>;</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgf50834d" class="outline-2">
<h2 id="orgf50834d">Exercise 3.40</h2>
<div class="outline-text-2" id="text-orgf50834d">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Give all possible values of `x' that can result from executing
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">x</span> 10)

(parallel-execute (<span style="color: #531ab6;">lambda</span> () (set! x (* x x)))
                  (<span style="color: #531ab6;">lambda</span> () (set! x (* x x x))))
</pre>
</div>

<p>
Which of these possibilities remain if we instead use serialized
procedures:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">x</span> 10)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">s</span> (make-serializer))

(parallel-execute (s (<span style="color: #531ab6;">lambda</span> () (set! x (* x x))))
                  (s (<span style="color: #531ab6;">lambda</span> () (set! x (* x x x)))))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li>The first λ involves three events:
<ul class="org-ul">
<li>two accesses of the variable <code>x</code>; let's called them `1a' and `1b';</li>
<li>one <code>set!</code>; let's call it `1s'.</li>
</ul></li>
<li>The second λ involves four events:
<ul class="org-ul">
<li>three accesses of the variable <code>x</code>; let's called them `2a', `2b',
and `2c';</li>
<li>one <code>set!</code>; let's call it `1s'.</li>
</ul></li>

<li>If we serialize, then there are only two possible sequences.</li>

<li>Here is one:
<ul class="org-ul">
<li>1a (x is accessed as 10)</li>
<li>1b (x is accessed as 10)</li>
<li>1s (x = 10 * 10 = 100);</li>
<li>2a (x is accessed as 100)</li>
<li>2b (x is accessed as 100)</li>
<li>2c (x is accessed as 100)</li>
<li>2s (x = 100 * 100 * 100 = 1000000)</li>
</ul></li>

<li>Here is the other:
<ul class="org-ul">
<li>2a (x is accesses as 10)</li>
<li>2b (x is accesses as 10)</li>
<li>2c (x is accesses as 10)</li>
<li>2s (x = 10 * 10 * 10 = 1000)</li>
<li>1a (x is accesses as 1000)</li>
<li>1b (x is accesses as 1000)</li>
<li>1s (x = 1000 * 1000 = 1000000)</li>
</ul></li>

<li>If we don't serialize, then, besides the two sequences above, other
sequences are possible.</li>

<li>Here is one:
<ul class="org-ul">
<li>1a (x is accessed as 10)</li>
<li>2a (x is accessed as 10)</li>
<li>1b (x is accessed as 10)</li>
<li>1s (x = 10 * 10 = 100)</li>
<li>2b (x is accessed as 100)</li>
<li>2c (x is accessed as 100)</li>
<li>2s (x = 10 * 100 * 100 = 100000)</li>
</ul></li>
</ul>
</div>
</div>
