blog/28.org
* Exercise 3.41
*Exercise*

#+begin_quote
Ben Bitdiddle worries that it would be better to implement the bank
account as follows (where the commented line has been changed):

#+begin_src scheme
  (define (make-account balance)
    (define (withdraw amount)
      (if (>= balance amount)
          (begin (set! balance (- balance amount))
                 balance)
          "Insufficient funds"))
    (define (deposit amount)
      (set! balance (+ balance amount))
      balance)
    ;; continued on next page

    (let ((protected (make-serializer)))
      (define (dispatch m)
        (cond ((eq? m 'withdraw) (protected withdraw))
              ((eq? m 'deposit) (protected deposit))
              ((eq? m 'balance)
               ((protected (lambda () balance)))) ; serialized
              (else (error "Unknown request -- MAKE-ACCOUNT"
                           m))))
      dispatch))
#+end_src

because allowing unserialized access to the bank balance can result in
anomalous behavior.  Do you agree?  Is there any scenario that
demonstrates Ben's concern?
#+end_quote

*Answer*:

The only reason I can think of why one might want to adopt Ben
Bitdiddle's implementation is the following.

Without BB's serialization, if one attempts to access the balance,
while somebody else is depositing/withdrawing, then one could get a
value which is would to change immediately after. With BB's
serialization, this would not happen. (The analogous ``problem'' of
somebody depositing/withdrawing when someone else is accessing would
remained. The person accessing the value would get a value which is
going to change immediately after the access.)

However, it's far-fetched to consider that as an anomaly. As far as I
can see, unserialized access to the bank balance is safe.

* Exercise 3.42
*Exercise*:

#+begin_quote
Ben Bitdiddle suggests that it's a waste of time to create a new
serialized procedure in response to every `withdraw' and `deposit'
message.  He says that `make-account' could be changed so that the
calls to `protected' are done outside the `dispatch' procedure.  That
is, an account would return the same serialized procedure (which was
created at the same time as the account) each time it is asked for a
withdrawal procedure.

#+begin_src scheme
  (define (make-account balance)
    (define (withdraw amount)
      (if (>= balance amount)
          (begin (set! balance (- balance amount))
                 balance)
          "Insufficient funds"))
    (define (deposit amount)
      (set! balance (+ balance amount))
      balance)
    (let ((protected (make-serializer)))
      (let ((protected-withdraw (protected withdraw))
            (protected-deposit (protected deposit)))
        (define (dispatch m)
          (cond ((eq? m 'withdraw) protected-withdraw)
                ((eq? m 'deposit) protected-deposit)
                ((eq? m 'balance) balance)
                (else (error "Unknown request -- MAKE-ACCOUNT"
                             m))))
        dispatch)))
#+end_src

Is this a safe change to make?  In particular, is there any difference
in what concurrency is allowed by these two versions of
`make-account'?
#+end_quote

*Answer*:

The change seems safe to me. I don't see any change in the
concurrency. The only difference is that the calls ~(protected
withdraw)~ and ~(protected-deposit)~ are done only once.

