blog/28.html

<div id="outline-container-org0a9ee1b" class="outline-2">
<h2 id="org0a9ee1b">Exercise 3.41</h2>
<div class="outline-text-2" id="text-org0a9ee1b">
<p>
<b>Exercise</b>
</p>

<blockquote>
<p>
Ben Bitdiddle worries that it would be better to implement the bank
account as follows (where the commented line has been changed):
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-account</span> balance)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">withdraw</span> amount)
    (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
        (<span style="color: #531ab6;">begin</span> (set! balance (- balance amount))
               balance)
        <span style="color: #3548cf;">"Insufficient funds"</span>))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">deposit</span> amount)
    (set! balance (+ balance amount))
    balance)
  <span style="color: #595959;">;; </span><span style="color: #595959;">continued on next page</span>

  (<span style="color: #531ab6;">let</span> ((protected (make-serializer)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m)
      (<span style="color: #531ab6;">cond</span> ((eq? m 'withdraw) (protected withdraw))
            ((eq? m 'deposit) (protected deposit))
            ((eq? m 'balance)
             ((protected (<span style="color: #531ab6;">lambda</span> () balance)))) <span style="color: #595959;">; </span><span style="color: #595959;">serialized</span>
            (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MAKE-ACCOUNT"</span>
                         m))))
    dispatch))
</pre>
</div>

<p>
because allowing unserialized access to the bank balance can result in
anomalous behavior.  Do you agree?  Is there any scenario that
demonstrates Ben's concern?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The only reason I can think of why one might want to adopt Ben
Bitdiddle's implementation is the following.
</p>

<p>
Without BB's serialization, if one attempts to access the balance,
while somebody else is depositing/withdrawing, then one could get a
value which is would to change immediately after. With BB's
serialization, this would not happen. (The analogous ``problem'' of
somebody depositing/withdrawing when someone else is accessing would
remained. The person accessing the value would get a value which is
going to change immediately after the access.)
</p>

<p>
However, it's far-fetched to consider that as an anomaly. As far as I
can see, unserialized access to the bank balance is safe.
</p>
</div>
</div>

<div id="outline-container-orgdaaefac" class="outline-2">
<h2 id="orgdaaefac">Exercise 3.42</h2>
<div class="outline-text-2" id="text-orgdaaefac">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Ben Bitdiddle suggests that it's a waste of time to create a new
serialized procedure in response to every `withdraw' and `deposit'
message.  He says that `make-account' could be changed so that the
calls to `protected' are done outside the `dispatch' procedure.  That
is, an account would return the same serialized procedure (which was
created at the same time as the account) each time it is asked for a
withdrawal procedure.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-account</span> balance)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">withdraw</span> amount)
    (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
        (<span style="color: #531ab6;">begin</span> (set! balance (- balance amount))
               balance)
        <span style="color: #3548cf;">"Insufficient funds"</span>))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">deposit</span> amount)
    (set! balance (+ balance amount))
    balance)
  (<span style="color: #531ab6;">let</span> ((protected (make-serializer)))
    (<span style="color: #531ab6;">let</span> ((protected-withdraw (protected withdraw))
          (protected-deposit (protected deposit)))
      (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m)
        (<span style="color: #531ab6;">cond</span> ((eq? m 'withdraw) protected-withdraw)
              ((eq? m 'deposit) protected-deposit)
              ((eq? m 'balance) balance)
              (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MAKE-ACCOUNT"</span>
                           m))))
      dispatch)))
</pre>
</div>

<p>
Is this a safe change to make?  In particular, is there any difference
in what concurrency is allowed by these two versions of
`make-account'?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The change seems safe to me. I don't see any change in the
concurrency. The only difference is that the calls <code>(protected
withdraw)</code> and <code>(protected-deposit)</code> are done only once.
</p>
</div>
</div>
