blog/28.html

<div id="outline-container-org253be8f" class="outline-2">
<h2 id="org253be8f">Exercise 3.43</h2>
<div class="outline-text-2" id="text-org253be8f">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Suppose that the balances in three accounts start out as $10, $20, and
$30, and that multiple processes run, exchanging the balances in the
accounts.  Argue that if the processes are run sequentially, after any
number of concurrent exchanges, the account balances should be $10,
$20, and $30 in some order.  Draw a timing diagram like the one in
Figure 3-29 to show how this condition can be violated if the
exchanges are implemented using the first version of the
account-exchange program in this section.  On the other hand, argue
that even with this `exchange' program, the sum of the balances in the
accounts will be preserved.  Draw a timing diagram to show how even
this condition would be violated if we did not serialize the
transactions on individual accounts.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li><p>
``Argue that if the processes are run sequentially, after any number
of concurrent exchanges, the account balances should be $10, $20,
and $30 in some order.''
</p>

<p>
An exchange just moves the value of a variable <code>foo</code> into another
variable <code>bar</code>, as well as the value of <code>bar</code> in <code>foo</code>. So, if any
exchange is atomic (that is, cannot be be interleaved with another
exchange), then the final value values of the variable involved can
only change in their order
</p></li>

<li><p>
``Draw a timing diagram like the one in Figure 3-29 to show how this
condition can be violated if the exchanges are implemented using the
first version of the account-exchange program in this section.''
</p>

<p>
An example (without the diagram) is offered by Authors themselves at
page 308.
</p>

<pre class="example">
    Peters swaps A1 and A2, and Paul swaps A1 and A3:

  -------------------------------------------------------------

 |   Peter             A1     A2     A3        Paul
 |
 |                     10     20     30
 |
 |   calculates
 |   diff A1/A2
 |   (-10)
 |                                           calculates
 |                                           diff A1/A3
 |                                           (-20)
 |
 |                     30&lt;-------------------withdraw -20 A1
 |
 |                                   10&lt;-----deposit -20 A3
 |
 |   withdraw -10 A1--&gt;40
 |
 |   deposit -10 A2----------&gt;10
 V
time
</pre></li>

<li><p>
``On the other hand, argue that even with this `exchange' program,
the sum of the balances in the accounts will be preserved.''
</p>

<p>
Each exchange adds and removes the <i>same</i> amount to a variable and
from another variable. This is enough to conclude that the sum of
everything cannot change.
</p></li>

<li><p>
``Draw a timing diagram to show how even this condition would be
violated if we did not serialize the transactions on individual
accounts''
</p>

<p>
In order to violate the condition we can reproduce the kind of
situation previously presented by Authors at page 301 (interleaving
the events of two withdrawals):
</p>

<pre class="example">
  Peters swaps A1 and A2, and Paul swaps A1 and A3:

  -------------------------------------------------------------

  |    Peter             A1     A2     A3        Paul
  |
  |                      10     20     30
  |
  |  calculates
  |  diff (-10)
  |
  |                                             calculates
  |                                             diff (-20)
  |
  |  accesses A1 (10)
  |
  |                                             accesses A1 (10)
  |
  |  computes 20
  |
  |                                             computes 30
  |
  |    sets A1 to 20----&gt;20
  |
  |                      30&lt;--------------------sets A1 to 30
  |
  |    deposits -10 2----------&gt;20
  |
  |                                    10&lt;------deposits -20 3
  V
time
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org1a70e89" class="outline-2">
<h2 id="org1a70e89">Exercise 3.46</h2>
<div class="outline-text-2" id="text-org1a70e89">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Suppose that we implement <code>test-and-set!</code> using an ordinary procedure
as shown in the text, without attempting to make the operation atomic.
Draw a timing diagram like the one in Figure 3-29 to demonstrate how
the mutex implementation can fail by allowing two processes to acquire
the mutex at the same time.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
<pre class="example">
  |    Peter             mutex             Paul
  |      |                                  |
  |      |               false              |
  |      |                                  |
  |    test:                                |
  |    okay                                 |
  |      |                                  |
  |      |                                test:
  |      |                                okay
  |      |                                  |
  |      |                                does
  |      |                                stuff
  |      |                                  |
  |     does                                |
  |     stuff                               |
  |      |                                  |
  |     set-------------&gt;true               |
  |                                         |
  V                      true&lt;-------------set
time
</pre>


<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span></p>
</div>
</body>
</html>
